In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [17]:
dict1={'NAMES':['ramesh','suresh','jeeshan',np.nan],
      'AGE':[31,32,np.nan,33],
      'CITY':[np.nan,'hyd','mum','chennai']}
data1=pd.DataFrame(dict1)

In [16]:
dict2={'NAMES':['ramesh','suresh','jeeshan',None],
      'AGE':[31,32,None,33],
      'CITY':[None,'hyd','mum','chennai']}
data2=pd.DataFrame(dict2)
data2

     NAMES   AGE     CITY
0   ramesh  31.0     None
1   suresh  32.0      hyd
2  jeeshan   NaN      mum
3     None  33.0  chennai

In [15]:
data2.isnull()

   NAMES    AGE   CITY
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [12]:
dict3={'NAMES':['ramesh','suresh','jeeshan','Null'],
      'AGE':[31,32,'Null',33],
      'CITY':['Null','hyd','mum','chennai']}
data3=pd.DataFrame(dict3)
data3

     NAMES   AGE     CITY
0   ramesh    31     Null
1   suresh    32      hyd
2  jeeshan  Null      mum
3     Null    33  chennai

In [13]:
data3.isnull()

   NAMES    AGE   CITY
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

**method-1**

>fill the missing values with random number

dataframe name=data1

method name:fillna

In [18]:
data1.fillna(40)

     NAMES   AGE     CITY
0   ramesh  31.0       40
1   suresh  32.0      hyd
2  jeeshan  40.0      mum
3       40  33.0  chennai

**method-2**

>fill the missing values with random number on specific column

dataframe name=data1

method name:fillna

In [21]:
data1['NAMES'].fillna('satish',inplace=True)
data1

     NAMES   AGE     CITY
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2  jeeshan   NaN      mum
3   satish  33.0  chennai

In [27]:
dict1={'NAMES':['ramesh','suresh',np.nan,'jeeshan'],
      'AGE':[31,32,33,np.nan],
      'CITY':[np.nan,'hyd','mum','chennai']}
data1=pd.DataFrame(dict1)
data1

     NAMES   AGE     CITY
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2      NaN  33.0      mum
3  jeeshan   NaN  chennai

**method-3**

 - bfill
    
 - ffill

 - pad
    
 - backfill

In [25]:
data1.fillna(method='backfill')

     NAMES   AGE     CITY
0   ramesh  31.0      hyd
1   suresh  32.0      hyd
2  jeeshan  33.0      mum
3  jeeshan   NaN  chennai

In [28]:
data1.fillna(method='ffill')

     NAMES   AGE     CITY
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2   suresh  33.0      mum
3  jeeshan  33.0  chennai

In [29]:
data1.fillna(method='pad')

     NAMES   AGE     CITY
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2   suresh  33.0      mum
3  jeeshan  33.0  chennai

In [30]:
data1.fillna(method='bfill')

     NAMES   AGE     CITY
0   ramesh  31.0      hyd
1   suresh  32.0      hyd
2  jeeshan  33.0      mum
3  jeeshan   NaN  chennai

- bfill and backfill both are same

- pad and ffill both are same

**method-4**

- mean

- medain

- mode

In [32]:
age_mean=data1['AGE'].mean()
age_mean

32.0

In [34]:
data1['AGE'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: AGE, dtype: float64

In [35]:
age_median=data1['AGE'].median()
age_median

32.0

In [38]:
data1['AGE'].fillna(age_median,inplace=True)
data1

     NAMES   AGE     CITY
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2      NaN  33.0      mum
3  jeeshan  32.0  chennai

<img src="https://www.machinelearningplus.com/wp-content/uploads/2019/04/1_simple_euclidean_distance_formula-min-640x117.png" alt="Simple Euclidean Distance Formula – Machine Learning Plus" class=" nofocus" tabindex="0" aria-label="Simple Euclidean Distance Formula – Machine Learning Plus" role="button" data-bm="6">

 **method-5 KNN imputer**

KNN : k nearest neighbours
    
- in the knn imputers instead of taking mean of all the values -
- will choose neighbours data
- will take those mean only

In [45]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['AGE']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [44]:
from sklearn.impute import KNNImputerl

**method-6**

- based on other columns

- some times all above methods will not provide good justification 

- at that time we need to check other columns dependency also

- most of the time will pick a pick columns which have highest correlation